Revit 2026 API

# AnalyticalToPhysicalAssociationManagerAddAssociation(ElementId, ElementId) Method

---

Adds a new association between an analytical element and a physical element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddAssociation(
	ElementId analyticalElementId,
	ElementId physicalElementId
)
```
```vb
Public Sub AddAssociation (
	analyticalElementId As ElementId,
	physicalElementId As ElementId
)
```
```cpp
public:
void AddAssociation(
	ElementId^ analyticalElementId,
	ElementId^ physicalElementId
)
```
```fsharp
member AddAssociation :
        analyticalElementId : ElementId *
        physicalElementId : ElementId -> unit
```

#### Parameters

analyticalElementId ElementId
     Id of the analytical element.
physicalElementId ElementId
     Id of the physical element.

| Exception | Condition |
| --- | --- |
| ArgumentException | Analytical id is not valid or has already defined another association. -or- Physical id is not valid or has already defined another association. |
| ArgumentNullException | A non-optional argument was null |

The arguments must be ids of an analytical and of a physical element that don't have other associations, otherwise an exception is thrown. Physical element can have one of these categories:

  * Columns
  * Curtain Wall Panels
  * Floors
  * Generic Models
  * Mass
  * Parts
  * Railings
  * Ramps
  * Roofs
  * Stairs
  * Structural Columns
  * Structural Foundation
  * Structural Framing
  * Structural Trusses
  * Structural Beam System
  * Walls

Analytical element can have one of these categories:
  * Analytical Member
  * Analytical Panel

#### Reference

AnalyticalToPhysicalAssociationManager Class

AddAssociation Overload

Autodesk.Revit.DB.Structure Namespace